//TODO Напишіть код, який запитуватиме// логін за допомогою prompt і буде виводити результат// в консоль браузера// Якщо користувач вводить "Admin",// то prompt запитує пароль.// Якщо нічого не ввели або натиснута клавіша Esc// вивести рядок "Cancel"// Інакше вивести рядок "I don't know you"

//TODOПароль перевіряти так:
// Якщо введено пароль "I am admin",
// то вивести рядок "Hello!"
// інакше виводити рядок "Wrong password!"

//TODO У змінній min лежить число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число(у першу, другу, третю чи четверту).

//TODO Напишіть через світч пошук автора мови програмування// Пишемо назву мови у шаблонному рядку отримує відповідь: мова та автор// PHP Расмус Лердорф// C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота// Swift Кріс Латтнер
// JS Брендан Ейх
// Java Джеймс Гослінг
// Python Гвідо ван Россум

//TODO Напишіть цикл, який виводить у консоль
//1. числа від max до min за спаданням
// 2. Виведіть у консоль усіх парні числа від min до max

//TODO 3. За допомогою циклу for додайте всі парні числа від min до max
//const max = 90;
//const min = 33;

//TODO Напишіть цикл, який пропонує ввести// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити// ввести ще раз і так далі.
// Цикл повинен запитувати число, поки користувач не// введе число більше 100, або натисне кнопку
// Скасування в prompt

//TODO Введіть рядок в prompt
// Виведіть кількість голосних букв в цьому рядку

// При завантаженні сторінки користувачеві пропонується// в prompt ввести число. Після введення число додається до значення// змінної total.// Операція введення числа продовжується доти,// поки користувач не натисне кнопку Cancel в prompt.// Після того як користувач припинив введення, натиснувши на
// кнопку Cancel, показати console.log з рядком "Загальна сума введених чисел дорівнює [число]."

// Зробити перевірку, що користувач ввів саме число,
// а не довільний набір символів.
